app/views/pins/show.html.haml

SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 7]]
---
						%h2="Commenti:"
						= @pin.comments.each do |comment|
							.box.panel.panel-default
								.panel-body