app/views/comments/_form.html.haml

= simple_form_for @pin.comments.create, url: pin_comments_path(pin_id: @pin.id, id: @pin.user), method: :post, remote: true do |f|
	- if @pin.comments.create.errors.any?
---
SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 7]]