app/views/comments/_show.html.haml

- @pin.comments.each do |c|
---
SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = ?  [["pin_id", 13]]