app/controllers/comments_controller.rb

  def create
    @comment = Comment.create[:user_id]
    @comment.save
---
INSERT INTO "comments" ("body", "pin_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "asas"], ["pin_id", 12], ["created_at", "2022-06-03 10:43:23.493056"], ["updated_at", "2022-06-03 10:43:23.493056"], ["user_id", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.user == current_user || @pin.user == current_user
      @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]

    def find_pin
      @pin = Pin.find(params[:pin_id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]