app/controllers/comments_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def create
    @pin = Pin.find(params[:pin_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."pin_id" = ? AND "comments"."id" = ? LIMIT ?  [["pin_id", 11], ["id", 11], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:pin_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."pin_id" = ? AND "comments"."id" = ? LIMIT ?  [["pin_id", 11], ["id", 11], ["LIMIT", 1]]
---
  def destroy
    @comment = Comment.find(params[:pin_id])