app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC")
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", "2022-06-01 14:56:57.162591"], ["updated_at", "2022-06-01 14:56:57.162591"], ["user_id", 1]]

  def edit
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?

  def find_pin
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]