app/controllers/pins_controller.rb

  def find_pin
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]